<?php

declare(strict_types=1);

return [
        /*
     |--------------------------------------------------------------------------
     | シーンタグ言語行　カスタム作成
     |--------------------------------------------------------------------------
     */
    'vacation' => '休日',
    'office' => 'オフィス',
    'event' => 'イベント',
    'school' => '学校',
    'party' => 'パーティー',
    'drive' => 'ドライブ',
    'trip' => '旅行',
    'drinking_party' => '飲み会',
    'lunch' => 'ランチ',
    'outing' => 'おでかけ',
    'shopping' => '買い物',
];
