<?php

declare(strict_types=1);

return [
        /*
     |--------------------------------------------------------------------------
     | 衣類アイテムカテゴリー言語行　カスタム作成
     |--------------------------------------------------------------------------
     */
    'tanktop' => 'トップス',
    'T-shirt' => 'Tシャツ',
    'shirt' => 'シャツ',
    'short-pants' => 'ショートパンツ',
    'half-pants' => 'ハーフパンツ',
    'skinny-pants' => 'スキニーパンツ',
    'setup' => 'セットアップ',
    'suits' => 'スーツ',
    'others' => 'その他',
    'cardigan' => 'カーディガン',
    'vest' => 'ベスト',
    'jacket' => 'ジャケット',
    'room-wear' => 'ルームウェア―',
    'under-wear' => '下着',
    'kimono_yukata' => '着物/浴衣',
];
