<?php

declare(strict_types=1);

return [
    /*
     |--------------------------------------------------------------------------
     | 衣類アイテムカテゴリー言語行　カスタム作成
     |--------------------------------------------------------------------------
     */
    'cotton' => '綿（コットン）',
    'linen' => '麻（リネン）',
    'silk' => '絹（シルク）',
    'wool' => 'ウール',
    'cashmere' => 'カシミア',
    'alpaca' => 'アルパカ',
    'angora' => 'アンゴラ',
    'camel' => 'キャメル',
    'polyester' => 'ポリエステル',
    'nylon' => 'ナイロン',
    'acrylic' => 'アクリル',
    'polyurethane' => 'ポリウレタン',
    'rayon' => 'レーヨン',
    'polynosic' => 'ポリノジック',
    'cupra' => 'キュプラ',
    'acetate' => 'アセテート',
    'triacetate' => 'トリアセテート',
    'promix' => 'プロミックス',
    'modal' => 'モダール',
    'lyocell' => 'リヨセル',
    'tencel' => 'テンセル',
];
