<?php

declare(strict_types=1);

return [
    /*
     |--------------------------------------------------------------------------
     | シーンタグ言語行　カスタム作成
     |--------------------------------------------------------------------------
     */
    'vacation' => '休日',
    'office' => 'オフィス',
    'shopping' => '買い物',
    'outing' => 'おでかけ',
    'school' => '学校',
    'party' => 'パーティ',
    'drinking_party' => '飲み会',
    'lunch' => 'ランチ',
    'drive' => 'ドライブ',
    'trip' => '旅行',
    'remote_work' => 'リモートワーク',
    'indoor' => '旅行',
    'entrance_ceremony' => '入学式',
    'festival' => 'フェス',
];
