<?php

declare(strict_types=1);

return [
        /*
     |--------------------------------------------------------------------------
     | 衣類アイテムカテゴリー言語行　カスタム作成
     |--------------------------------------------------------------------------
     */
    'casual' => 'カジュアル',
    'formal' => 'フォーマル',
    'business' => 'ビジネス',
    'sporty' => 'スポーティ',
    'ceremonial' => '冠婚葬祭',
    'commute' => '通勤',
    'school' => '学校',
    'spring' => '春向け',
    'summer' => '夏向け',
    'autumn' => '秋向け',
    'winter' => '冬向け',
    'rainy_day' => '雨の日',
    'snowy_day' => '雪の日',
    'cold_protection' => '防寒',

];
