<?php

return [
    'temperature_ranges' => [
        [
            'min' => 29.5,
            'max' => null,
            'feel' => '暑く',
            'tops' => [
                'unisex' => [1, 2, 4, 6],
                'female' => [11, 13, 14, 16, 18, 19],
            ],
            'bottoms' => [
                'unisex' => [22, 23, 24, 25, 27, 28, 29, 31],
                'female' => [30],
            ],
            'outers' => [],
            'materials' => [1, 2, 9], //リネン、コットン、ポリエステル ※マスターテーブルidカラム参照
            'color' => 'red',
        ],
        [
            'min' => 24.5,
            'max' => 29.5,
            'feel' => 'やや暑く',
            'tops' => [
                'unisex' => [2, 4, 6],
                'female' => [11, 13, 14, 16, 18, 19],
            ],
            'bottoms' => [
                'unisex' => [22, 23, 24, 25, 27, 28, 29, 31],
                'female' => [30],
            ],
            'outers' => [],
            'materials' => [1, 2, 9], //リネン、コットン、ポリエステル
            'color' => 'yellow',
        ],
        [
            'min' => 20.5,
            'max' => 24.5,
            'feel' => '温かく',
            'tops' => [
                'unisex' => [3, 5, 7, 9],
                'female' => [12, 15, 17, 20],
            ],
            'bottoms' =>  [
                'unisex' => [22, 24, 26, 27, 28, 29, 31],
                'female' => [30],
            ],
            'outers' => [36, 38, 40, 43, 44, 46, 48, 51],
            'materials' => [1, 9], //コットン、ポリエステル
            'color' => 'green',
        ],
        [
            'min' => 16.5,
            'max' => 20.5,
            'feel' => '涼しく',
            'tops' => [
                'unisex' => [3, 5, 7, 9],
                'female' => [12, 15, 17, 20],
            ],
            'bottoms' => [
                'unisex' => [22, 24, 26, 27, 28, 29, 31],
                'female' => [30],
            ],
            'outers' => [36, 38, 40, 43, 44, 46, 48, 51],
            'materials' => [1, 9, 11], //コットン、アクリル
            'color' => 'teal',
        ],
        [
            'min' => 12.5,
            'max' => 16.5,
            'feel' => 'やや肌寒く',
            'tops' => [
                'unisex' => [3, 5, 7, 9],
                'female' => [12, 15, 17, 20],
            ],
            'bottoms' => [
                'unisex' => [22, 24, 26, 27, 28, 29, 31],
                'female' => [30],
            ],
            'outers' => [38, 40, 43, 44, 46, 48, 51],
            'materials' => [11, 4, 3], //ウール、アクリル、シルク
            'color' => 'cyan',
        ],
        [
            'min' => 8.5,
            'max' => 12.5,
            'feel' => '肌寒く',
            'tops' => [
                'unisex' => [3, 5, 7, 9, 8, 10],
                'female' => [12, 15, 17, 20],
            ],
            'bottoms' => [
                'unisex' => [22, 24, 26, 27, 31],
                'female' => [],
            ],
            'outers' => [37, 39, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50],
            'materials' => [11, 4, 3], //ウール、アクリル、シルク
            'color' => 'sky',
        ],
        [
            'min' => 5.5,
            'max' => 8.5,
            'feel' => '冬の寒さを',
            'tops' => [
                'unisex' => [3, 5, 7, 9, 8, 10],
                'female' => [12, 15, 17, 20],
            ],
            'bottoms' => [
                'unisex' => [22, 24, 26, 27, 31],
                'female' => [],
            ],
            'outers' => [37, 39, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50],
            'materials' => [11, 4, 3, 5, 6, 7], //ウール、カシミヤ、アルパカ、アンゴラ、アクリル
            'color' => 'blue',
        ],
        [
            'min' => null,
            'max' => 5.5,
            'feel' => '本格的な冬の寒さを',
            'tops' => [
                'unisex' => [3, 5, 7, 9, 8, 10],
                'female' => [12, 15, 17, 20],
            ],
            'bottoms' => [
                'unisex' => [22, 24, 26, 27, 31],
                'female' => [],
            ],
            'outers' => [37, 39, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50],
            'materials' => [11, 4, 3, 5, 6, 7, 8], //ウール、カシミヤ、アルパカ、アンゴラ、アクリル、キャメル
            'color' => 'blue',
        ],
    ],
];
