<?php

return [
    'temperature_ranges' => [
        [
            'min' => 29.5,
            'max' => null,
            'feel' => '暑く',
            'tops' => [4, 3, 2, 1],
            'bottoms' => [12, 13, 14, 18, 15, 11],
            'outers' => [],
            'materials' => [1, 2], //リネン、コットン ※マスターテーブルidカラム参照
            'color' => 'red',
        ],
        [
            'min' => 24.5,
            'max' => 29.5,
            'feel' => 'やや暑く',
            'tops' => [4, 3, 2],
            'bottoms' => [18, 12, 13, 14, 15, 16, 11],
            'outers' => [],
            'materials' => [1, 2], //リネン、コットン
            'color' => 'yellow',
        ],
        [
            'min' => 20.5,
            'max' => 24.5,
            'feel' => '温かく',
            'tops' => [3, 2],
            'bottoms' => [18, 12, 13, 14, 16, 22],
            'outers' => [28, 26, 29, 32, 36],
            'materials' => [1, 9], //コットン、ポリエステル
            'color' => 'green',
        ],
        [
            'min' => 16.5,
            'max' => 20.5,
            'feel' => '涼しく',
            'tops' => [3, 2, 5],
            'bottoms' => [19, 12, 13, 14, 16, 17, 20, 18],
            'outers' => [26, 28, 29, 30, 32, 34, 36, 39, 27],
            'materials' => [1, 11], //コットン、ポリエステル
            'color' => 'teal',
        ],
        [
            'min' => 12.5,
            'max' => 16.5,
            'feel' => 'やや肌寒く',
            'tops' => [3, 2, 8, 6, 7],//
            'bottoms' => [19, 12, 13, 14, 16, 17, 20, 18],
            'outers' => [28, 33, 34, 32, 36, 39, 30, 40, 41, 38],
            'materials' => [11, 4], //薄手のウール、アクリル
            'color' => 'cyan',
        ],
        [
            'min' => 8.5,
            'max' => 12.5,
            'feel' => '肌寒く',
            'tops' => [3, 2, 8, 6, 7],
            'bottoms' => [19, 12, 13, 14, 16,  17, 18],
            'outers' => [31, 33, 42, 40, 41, 43, 39, 36, 32, 33, 34, 38],
            'materials' => [11, 4], //ウール、アクリル
            'color' => 'sky',
        ],
        [
            'min' => 5.5,
            'max' => 8.5,
            'feel' => '冬の寒さを',
            'tops' => [3, 2, 8, 6, 7],
            'bottoms' => [19, 12, 13, 14, 16, 17, 18],
            'outers' => [31, 42,  33, 40, 41, 43, 44, 33, 38],
            'materials' => [11, 4], //厚手のウール、アクリル
            'color' => 'blue',
        ],
        [
            'min' => null,
            'max' => 5.5,
            'feel' => '本格的な冬の寒さを',
            'tops' => [3, 2, 8, 6, 7],
            'bottoms' => [19, 13, 17, 18],
            'outers' => [31, 42,  33, 40, 41, 43, 44, 33, 38],
            'materials' => [11, 4, 8], //厚手のウール、アクリル
            'color' => 'blue',
        ],
    ],
];
