<?php

return [
    'temperature_ranges' => [
        [
            'min' => 29.5,
            'max' => null,
            'feel' => '暑く',
            'tops' => [4, 3, 2, 1, 8], //checked
            'bottoms' => [14, 16, 19, 21, 23, 15, 17],
            'outers' => [],
            'materials' => [1, 2], //リネン、コットン ※マスターテーブルidカラム参照
            'color' => 'red',
        ],
        [
            'min' => 24.5,
            'max' => 29.5,
            'feel' => 'やや暑く',
            'tops' => [4, 3, 2, 8], //checked
            'bottoms' => [14, 16, 19, 21, 23, 15, 17],
            'outers' => [],
            'materials' => [1, 2], //リネン、コットン
            'color' => 'yellow',
        ],
        [
            'min' => 20.5,
            'max' => 24.5,
            'feel' => '温かく',
            'tops' => [3, 2, 8, 9, 11, 12], //checked
            'bottoms' => [14, 16, 19, 21, 23],
            'outers' => [28, 29, 31, 33],
            'materials' => [1, 9], //コットン、ポリエステル
            'color' => 'green',
        ],
        [
            'min' => 16.5,
            'max' => 20.5,
            'feel' => '涼しく',
            'tops' => [3, 2, 5, 12],
            'bottoms' => [14, 16, 19, 21, 23, 18],
            'outers' => [28, 29, 31, 33, 34, 35],
            'materials' => [1, 11], //コットン、アクリル
            'color' => 'teal',
        ],
        [
            'min' => 12.5,
            'max' => 16.5,
            'feel' => 'やや肌寒く',
            'tops' => [3, 2, 5, 6], //checked
            'bottoms' => [14, 16, 19, 21, 23, 18],
            'outers' => [28, 29, 31, 33, 34, 35],
            'materials' => [11, 4], //薄手のウール、アクリル
            'color' => 'cyan',
        ],
        [
            'min' => 8.5,
            'max' => 12.5,
            'feel' => '肌寒く',
            'tops' => [3, 2, 5, 6],
            'bottoms' => [14, 16, 19, 21, 23, 18],
            'outers' => [28, 29, 31, 33, 34, 35, 30, 32, 36, 37],
            'materials' => [11, 4, 5, 6], //ウール、アクリル、カシミヤ、アルパカ
            'color' => 'sky',
        ],
        [
            'min' => 5.5,
            'max' => 8.5,
            'feel' => '冬の寒さを',
            'tops' => [3, 2, 5, 6],
            'bottoms' => [14, 16, 19, 21, 23, 18],
            'outers' => [28, 29, 31, 33, 34, 35, 32, 36, 37],
            'materials' => [11, 4, 5, 6], //厚手のウール、アクリル、カシミヤ、アルパカ
            'color' => 'blue',
        ],
        [
            'min' => null,
            'max' => 5.5,
            'feel' => '本格的な冬の寒さを',
            'tops' => [3, 2, 5, 6],
            'bottoms' => [14, 16, 19, 21, 23, 18],
            'outers' => [28, 29, 31, 33, 34, 35, 32, 36, 37],
            'materials' => [11, 4, 5, 6, 8], //厚手のウール、アクリル、カシミヤ、アルパカ、キャメル
            'color' => 'blue',
        ],
    ],
];
